registration_client/app/controllers/registrations_controller.rb

  def create
    registration = Registration.create(role_id: params[:role_id], user_id: params[:user_id], event_id: params[:event_id])
---
INSERT INTO "registrations" ("created_at", "event_id", "role_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Wed, 05 Feb 2014 03:37:33 UTC +00:00], ["event_id", 1], ["role_id", 1], ["updated_at", Wed, 05 Feb 2014 03:37:33 UTC +00:00], ["user_id", 1]]