registration_client/app/controllers/registrations_controller.rb

  def create
    registration = Registration.create(role_id: params[:role_id], user_id: params[:user_id], event_id: params[:event_id])
---
INSERT INTO "registrations" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", Tue, 11 Feb 2014 17:43:59 UTC +00:00], ["updated_at", Tue, 11 Feb 2014 17:43:59 UTC +00:00]]

  def destroy

   registration =  Registration.delete(params[:event_id], params[:user_id])
---
DELETE FROM "registrations" WHERE "registrations"."id" = $1  [["id", 1]]