main_app/app/views/users/show.html.erb

SELECT "events".* FROM "events"
---
         <h4>Playdates:</h4>
         <h5><strong>Created: </strong><%= @user.created_events.count %></h5>