main_app/app/controllers/events_controller.rb

  def index
    events = Event.all.group_by{|event| event.date }
---
SELECT "events".* FROM "events"

  def create
    @event = Event.new(event_params)
    @location = Location.new(location_params)
    if @event.valid? && @location.valid?
      @event.save
      @location.save
      role = Role.find_by(identity: "creator")
      RegistrationClient.create(role.id, current_user.id, @event.id)
---
INSERT INTO "events" ("created_at", "date", "description", "end_time", "name", "start_time", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
INSERT INTO "locations" ("city", "created_at", "state", "street_address", "updated_at", "venue", "zipcode") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
SELECT "roles".* FROM "roles" WHERE "roles"."identity" = 'creator' LIMIT 1
INSERT INTO "registrations" ("created_at", "event_id", "role_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Sat, 01 Feb 2014 19:14:22 UTC +00:00], ["event_id", 1], ["role_id", 1], ["updated_at", Sat, 01 Feb 2014 19:14:22 UTC +00:00], ["user_id", 1]]
INSERT INTO "roles" ("created_at", "identity", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Sat, 01 Feb 2014 19:14:22 UTC +00:00], ["identity", "creator"], ["updated_at", Sat, 01 Feb 2014 19:14:22 UTC +00:00]]

  def edit
    if Event.find(params[:id]).creator == current_user
      @event = Event.find(params[:id])
      @location = Location.find(@event.location_id)
---
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", "331"]]
SELECT "locations".* FROM "locations" WHERE "locations"."id" = $1 LIMIT 1  [["id", 87]]

  def update
    @event = Event.find(params[:id])
    @location = Location.find(@event.location_id)
    if @event.update(event_params) && @location.update(location_params)
---
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", "331"]]
SELECT "locations".* FROM "locations" WHERE "locations"."id" = $1 LIMIT 1  [["id", 87]]
UPDATE "events" SET "description" = $1, "name" = $2, "start_time" = $3, "end_time" = $4, "updated_at" = $5 WHERE "events"."id" = 331
UPDATE "locations" SET "street_address" = $1, "updated_at" = $2 WHERE "locations"."id" = 87  [["street_address", "1062 Delaware st"], ["updated_at", Tue, 04 Feb 2014 23:18:20 UTC +00:00]]