main_app/app/controllers/registrations_controller.rb

SELECT "roles".* FROM "roles" WHERE "roles"."identity" = 'attendee' LIMIT 1
INSERT INTO "registrations" ("created_at", "event_id", "role_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Wed, 05 Feb 2014 03:15:39 UTC +00:00], ["event_id", 1], ["role_id", 1], ["updated_at", Wed, 05 Feb 2014 03:15:39 UTC +00:00], ["user_id", 1]]
---
  def create
    role = Role.find_by(identity: "attendee")
    RegistrationClient.create(role.id, current_user.id, params[:event_id])