main_app/app/controllers/users_controller.rb

SELECT "events".* FROM "events"
---
  def show
    if params[:id] == current_user.id
      @user = current_user
    else
      @user = UserClient.get_user(params[:id])
    end

    @large_avatar = @user.large_avatar
    @date = @user.events.map(&:date)