main_app/app/views/events/_event.html.erb

    <h4>Playdates:</h4>
    <h5><strong>Created: </strong><%= event.creator.first.created_events.count %></h5>
---
SELECT "events".* FROM "events"