app/controllers/events_controller.rb

  def create
    @event = Event.new(event_params)
    @location = Location.new(location_params)
    if @event.valid? && @location.valid?
      @event.save
      @location.save
      role = Role.find_by(identity: "creator")
      Registration.create(role_id: role.id, user_id: current_user.id, event_id: @event.id)
---
INSERT INTO "events" ("created_at", "description", "location_id", "name", "starts_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
INSERT INTO "locations" ("city", "created_at", "state", "street_address", "updated_at", "venue", "zipcode") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
SELECT "roles".* FROM "roles" WHERE "roles"."identity" = 'creator' LIMIT 1
INSERT INTO "registrations" ("created_at", "event_id", "role_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Fri, 31 Jan 2014 00:15:15 UTC +00:00], ["event_id", 73], ["role_id", 14], ["updated_at", Fri, 31 Jan 2014 00:15:15 UTC +00:00], ["user_id", 58]]