app/controllers/registrations_controller.rb

  def create
    event = Event.find(params[:event_id])
    enlisted = event.registrations.find {|r| r.is_enlisted?(r)}
    role = Role.find_by(identity: "attendee")
    if current_user == event.creator || (enlisted)
      redirect_to events_path, notice: "You are already registered for this event"
    else
      Registration.create(role_id: role.id, user_id: current_user.id, event_id: event.id)
---
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", "77"]]
SELECT "registrations".* FROM "registrations" WHERE "registrations"."event_id" = $1  [["event_id", 11]]
SELECT "roles".* FROM "roles" WHERE "roles"."identity" = 'attendee' LIMIT 1
INSERT INTO "registrations" ("created_at", "event_id", "role_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Thu, 30 Jan 2014 22:32:54 UTC +00:00], ["event_id", 77], ["role_id", 1], ["updated_at", Thu, 30 Jan 2014 22:32:54 UTC +00:00], ["user_id", 64]]